app/views/dashboards/_challenge_overview_chart.html.erb

SELECT COUNT(*) FROM `questions` WHERE `questions`.`challenge_id` = 6
SELECT `questions`.* FROM `questions` WHERE `questions`.`challenge_id` = 1
---
  <div class = "col-lg-3 col-md-6">
    <h4><span class="glyphicon glyphicon-flag"></span> <%= pluralize(current_challenge.questions.count, 'Question') %></h4>