app/views/dashboards/_individual_score_chart.html.erb

  <div class = "col-lg-3 col-md-6">
    <h4><span class="glyphicon glyphicon-flag"></span> Questions: <%= @response[:challenge].questions.count  %> </h4>
---
SELECT COUNT(*) FROM `questions` WHERE `questions`.`challenge_id` = 6
SELECT `questions`.* FROM `questions` WHERE `questions`.`challenge_id` = 6

    <% @response[:challenge].user_scores.each do |sc| %>
        <tr><td><%= User.find(sc[0]).full_name %></td><td><%= sc[1] %></td></tr>
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1