app/views/challenges/_questions_list_in_modal.html.erb

  <div class="carousel-inner">
    <% challenge.questions.each.with_index do |question,index| %>
---
SELECT `questions`.* FROM `questions` WHERE `questions`.`challenge_id` = 6