app/views/challenges/user_index.html.erb

<ul class="nav nav-tabs nav-justified" role="tablist">
	<% @current_challenge.questions.count.times do |i| %>
---
SELECT COUNT(*) FROM `questions` WHERE `questions`.`challenge_id` = 6
SELECT `questions`.* FROM `questions` WHERE `questions`.`challenge_id` = 6