app/controllers/challenges_controller.rb

	def index
		redirect_to user_index_path if !session[:user].is_a?Admin
		@challenges = Challenge.order("active DESC, created_at DESC").paginate(:page => params[:page], :per_page => 10)
---
SELECT `challenges`.* FROM `challenges` ORDER BY active DESC, created_at DESC LIMIT 10 OFFSET 0

	def finish
		challenge_id = params[:challenge_id]
		ch = Challenge.find_by_id(challenge_id)
		render :text => "Challenge not found", :status => 500 and return unless ch
		ch.update_attribute(:end_date, Time.now)
---
SELECT `challenges`.* FROM `challenges` WHERE `challenges`.`id` = 6 LIMIT 1
UPDATE `challenges` SET `end_date` = '2015-03-30 10:08:51', `updated_at` = '2015-03-30 10:08:51' WHERE `challenges`.`id` = 6

	def load_modal
		challenge_id = params[:challenge_id]
		ch = Challenge.find_by_id(challenge_id)
		(3-ch.questions.size).times {ch.questions.build}
---
SELECT `challenges`.* FROM `challenges` WHERE `challenges`.`id` = 6 LIMIT 1
SELECT COUNT(*) FROM `questions` WHERE `questions`.`challenge_id` = 6
SELECT `questions`.* FROM `questions` WHERE `questions`.`challenge_id` = 6

	def save_challenge
		challenge = Challenge.find_by_id(params[:challenge_id])
		questions = challenge.questions
		params["challenge"]["questions_attributes"].each do | index,ele |
			obj = ele.dup.reject{|k,v| k=="test_cases" }
			test_cases = ele["test_cases"]
			if questions[index.to_i]
				questions[index.to_i].update_question_with_test_cases(obj,test_cases)
			elsif !obj["title"].empty?
				Question.create_with_test_cases(obj.merge(:challenge_id => params[:challenge_id]),test_cases)
---
UPDATE `questions` SET `description` = 'Problem :\r\n\r\nBajirao is on a date with his girlfriend Avni. It is a romantic night and they are playing a game of words.\r\n\r\nThe rule of this game is that if Bajirao says a word such that no adjacent letters occurring in the word are same then he gets a kiss from her otherwise he gets a slap.\r\n\r\nInput :\r\n\r\nThe first line consists of T the number of test cases. The next T lines are such that each line consists of a single word spoken by Bajirao.\r\n\r\nOutput\r\n\r\nFor every test case, on a new line print \'KISS\' if Bajirao gets a kiss and \'SLAP\' if Bajirao gets a slap.\r\n\r\nConstraints :\r\n\r\n1<=T<=100\r\n\r\n2<=Length of Word spoken by Bajirao<=100\r\n\r\nThe input word will comprise only of lower case English alphabets (a-z).\r\n\r\nSample Input (Plaintext Link)\r\n2\r\nremember\r\noccurring\r\nSample Output (Plaintext Link)\r\nKISS\r\nSLAP', `updated_at` = '2015-03-30 11:04:51' WHERE `questions`.`id` = 6
INSERT INTO `question_test_cases` (`created_at`, `input_file_content_type`, `input_file_file_name`, `input_file_file_size`, `input_file_updated_at`, `output_file_content_type`, `output_file_file_name`, `output_file_file_size`, `output_file_updated_at`, `points`, `question_id`, `updated_at`) VALUES ('2015-03-30 09:22:49', 'text/plain', 'one.txt', 25, '2015-03-30 09:22:49', 'text/plain', 'two.txt', 25, '2015-03-30 09:22:49', 150, 5, '2015-03-30 09:22:49')
INSERT INTO `questions` (`challenge_id`, `created_at`, `description`, `points`, `title`, `updated_at`) VALUES (6, '2015-03-30 09:22:36', 'testa', NULL, 'second test', '2015-03-30 09:22:36')

	def schedule
		start_time = DateTime.strptime(params[:start_time], '%m/%d/%Y %l:%M %p')
		end_time = DateTime.strptime(params[:end_time], '%m/%d/%Y %l:%M %p')
		challenge = Challenge.find(params[:challenge_id])
		if challenge && start_time.present? && end_time.present?
			challenge.update_attribute(:start_date, start_time)
---
UPDATE `challenges` SET `start_date` = '2015-03-29 00:00:00', `updated_at` = '2015-03-30 10:08:07' WHERE `challenges`.`id` = 1

	def create
		Challenge.create({:title => params[:title], :start_date => Time.at(params[:start_date].to_i/1000), :end_date => Time.at(params[:end_date].to_i/1000), :active => true})
---
INSERT INTO `challenges` (`active`, `created_at`, `end_date`, `start_date`, `title`, `updated_at`) VALUES (1, '2015-03-30 11:02:38', '2015-04-11 11:02:00', '2015-04-05 11:02:00', 'april second challenge', '2015-03-30 11:02:38')