app/controllers/dashboards_controller.rb

	def index
		@challenges = Challenge.order('challenges.start_date DESC').all
		@avg_scores = average_scores
		@member_engagement = Challenge.member_engagement
		@total_submissions = 0
		@member_engagement = (@member_engagement.map{|e| e[1]}.sum).to_f / @member_engagement.count
		@current_challenge = params[:challenge_id].present? ? Challenge.find_by_id(params[:challenge_id]) : Challenge.currently_running
		@current_questions = @current_challenge.questions unless @current_challenge.blank?
		if !@current_questions.blank?
			@chart_data = {
			    labels: [],
			    datasets: [],
			    results: []
			}
			((@current_challenge.start_date.to_date)..(@current_challenge.end_date.to_date)).each do |da|
				@chart_data[:labels].push(da.to_s)
			end
			@current_questions.each do |cq|
				sub_date = []
			  @chart_data[:labels].each {|label| sub_date.push(cq.submissions.collect{|s| s.created_at.to_date}.count(label.to_date))}
---
SELECT `challenges`.* FROM `challenges` ORDER BY challenges.start_date DESC
SELECT `challenges`.* FROM `challenges` WHERE `challenges`.`id` = 6 LIMIT 1
SELECT `questions`.* FROM `questions` WHERE `questions`.`challenge_id` = 1
SELECT COUNT(*) FROM `questions` WHERE `questions`.`challenge_id` = 6
SELECT SUM(`submissions`.`score`) AS sum_score, user_id AS user_id FROM `submissions` INNER JOIN `question_test_cases` ON `submissions`.`question_test_case_id` = `question_test_cases`.`id` INNER JOIN `questions` ON `question_test_cases`.`question_id` = `questions`.`id` WHERE `questions`.`challenge_id` = 1 GROUP BY user_id
SELECT `submissions`.* FROM `submissions` INNER JOIN `question_test_cases` ON `submissions`.`question_test_case_id` = `question_test_cases`.`id` WHERE `question_test_cases`.`question_id` = 1

	def average_score_charts
		@response = {}
		challenges = Challenge.last(10)
		@response[:challenge_names] = challenges.collect{|ch| ch.title}
---
SELECT `challenges`.* FROM `challenges` ORDER BY `challenges`.`id` DESC LIMIT 10
SELECT `challenges`.* FROM `challenges`

	def individual_score_chart
		@response = {}
		@response[:user_scores] = {}
		@response[:user_questions_scores] = []
		@response[:challenge] = Challenge.find_by_id(params[:challenge_id])
---
SELECT `challenges`.* FROM `challenges` WHERE `challenges`.`id` = 6 LIMIT 1

	def engagement_charts
		@response = {}
		member_engagement = Challenge.member_engagement
		@total_submissions = 0
		@response[:overall_engagement] = (member_engagement.map{|e| e[1]}.sum).to_f / member_engagement.count
		challenges = Challenge.last(10)
		@response[:challenge_names] = challenges.collect{|ch| ch.title}
---
SELECT `challenges`.* FROM `challenges` ORDER BY `challenges`.`id` DESC LIMIT 10
SELECT `challenges`.* FROM `challenges`