app/controllers/questions_controller.rb

SELECT `question_test_cases`.* FROM `question_test_cases` WHERE `question_test_cases`.`id` = 5 LIMIT 1
DELETE FROM `question_test_cases` WHERE `question_test_cases`.`id` = 5
---
  def delete_test_case
    qtc = QuestionTestCase.find_by_id(params[:question_test_case_id])
    if qtc
      qtc.delete