app/controllers/questions_controller.rb

  def delete_test_case
    ques = Question.find_by_id(params[:question_id])
---
SELECT `questions`.* FROM `questions` WHERE `questions`.`id` = 6 LIMIT 1