app/controllers/submissions_controller.rb

UPDATE `submissions` SET `result` = 0, `score` = 0, `updated_at` = '2015-03-30 09:23:32' WHERE `submissions`.`id` = 20
---
  def validate_submission
    @test_case_id = params["test_case_id"]
    @input_file = params["solution_file"]
    begin
      qtc = QuestionTestCase.find(@test_case_id)
      sub = Submission.create(:user_id => current_user.id, :question_test_case_id => qtc.id, :solution_file => @input_file)
      if sub.save!