app/controllers/submissions_controller.rb

  def validate_submission
    question_id = params["question_id"]
    solution = params["solution"]
    question = Question.find_by_id(question_id)
    debugger
    if question
      if question.test_case_output.gsub("\r","").strip == solution.strip
        flag = true
      end
      question.create_submission(current_user,flag.present?)
---
INSERT INTO `submissions` (`created_at`, `question_test_case_id`, `result`, `score`, `solution_file_content_type`, `solution_file_file_name`, `solution_file_file_size`, `solution_file_updated_at`, `updated_at`, `user_id`) VALUES ('2015-03-30 09:23:32', 2, NULL, NULL, 'text/plain', 'one.txt', 25, '2015-03-30 09:23:32', '2015-03-30 09:23:32', 2)
SELECT 1 AS one FROM `submissions` WHERE (`submissions`.`user_id` = BINARY 2 AND `submissions`.`id` != 20 AND `submissions`.`question_test_case_id` = 2) LIMIT 1
SELECT `question_test_cases`.* FROM `question_test_cases` WHERE `question_test_cases`.`id` = 2 LIMIT 1